snlkuharlocal/src/Enums/ТипыШтрихКодов/ТипыШтрихКодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыШтрихКодов</name>
  <enumValues>
    <name>Штука</name>
    <comment>Штрих код штуки</comment>
  </enumValues>
  <enumValues>
    <name>Блочок</name>
    <comment>Штрих код блочка</comment>
  </enumValues>
  <enumValues>
    <name>Коробка</name>
    <comment>Штрих код коробки</comment>
  </enumValues>
  <enumValues>
    <name>Палета</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/Паллета/Паллета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Паллета</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.Перемещение</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.Паллета</basedOn>
  <registerRecords>AccumulationRegister.АдресноеХранениеОстатки</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиЗХ</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиРасходныхМатериалов</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНакладной</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>ШКПаллеты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистЗагрузки</name>
    <type>
      <types>DocumentRef.ЛистЗагрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>СборнаяПаллета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SSCCКод</name>
    <comment>упаковочный для клиента Лента</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПаллетирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПаллетирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РеальноеПаллетирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Паллетировщик</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КроссДокинг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НеГабарит</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаХранения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияХранения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеКоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>КодАгрегации</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>КодАгрегацииСгенерирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УзелТСД</name>
    <type>
      <types>ExchangePlanRef.СкладТСД</types>
      <types>ExchangePlanRef.МобильныеТСД</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>Расформирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЛистыНабора</name>
    <attributes>
      <name>ЛистНабора</name>
      <type>
        <types>DocumentRef.ЛистПереукладки</types>
        <types>DocumentRef.ЛистНабора</types>
      </type>
    </attributes>
    <attributes>
      <name>ШКЛистаНабора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктДоставки</name>
      <type>
        <types>CatalogRef.ПунктыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяСканирования</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЛистаНабора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>17</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЛистаНабора</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГруппыТоваров</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКоробокВНакладной</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПаллет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемПаллет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодУпаковкиПаллеты</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SSCCКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>21</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Накладная</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковкиКороба</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодУпаковкиПаллеты</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/WebServices/wsPalletsExt/Module.bsl
&НаСервере
Функция В_JSON(Значение) Экспорт
	ЗначениеВнутр = ПривестиЗначение(Значение);
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON,ЗначениеВнутр);
	Возврат ЗаписьJSON.Закрыть();
КонецФункции
&НаСервере
Функция Из_JSON(Значение,ВСоответствие=Истина) Экспорт
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Значение);
	Возврат ПрочитатьJSON(ЧтениеJSON,ВСоответствие);
КонецФункции
&НаСервере
Функция ПривестиЗначение(Значение) Экспорт   
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		Возврат Значение;
	ИначеЕсли ТипЗнч(Значение) = Тип("Неопределено") Тогда	
		Возврат Значение;
	ИначеЕсли ТипЗнч(Значение) = Тип("Число") Тогда	
		Возврат Значение;
	ИначеЕсли ТипЗнч(Значение) = Тип("Дата") Тогда	
		Возврат Значение;
	ИначеЕсли ТипЗнч(Значение) = Тип("Число") Тогда	
		Возврат Значение;
	ИначеЕсли ТипЗнч(Значение) = Тип("Булево") Тогда	
		Возврат Значение;
	ИначеЕсли ТипЗнч(Значение) = Тип("Массив") Тогда	
		ЗначениеВнутр = Новый Массив;
		Для каждого СтрЗнач Из Значение Цикл
			ЗначениеВнутр.Добавить(ПривестиЗначение(СтрЗнач));
		КонецЦикла;	
		Возврат ЗначениеВнутр;
	ИначеЕсли ТипЗнч(Значение) = Тип("Структура") Тогда	
		ЗначениеВнутр = Новый Структура;
		Для каждого СтрЗнач Из Значение Цикл
			ЗначениеВнутр.Вставить(СтрЗнач.Ключ,ПривестиЗначение(СтрЗнач.Значение));
		КонецЦикла;	
		Возврат ЗначениеВнутр;
	ИначеЕсли ТипЗнч(Значение) = Тип("ТаблицаЗначений") Тогда	
		ЗначениеВнутр = Новый Массив;
		Для каждого СтрЗнач Из Значение Цикл
			СтрокаЗначения = Новый Структура();
			Для каждого Колонка Из Значение.Колонки Цикл
				СтрокаЗначения.Вставить(Колонка.Имя,ПривестиЗначение(СтрЗнач[Колонка.Имя]));	
			КонецЦикла;	
			ЗначениеВнутр.Добавить(СтрокаЗначения);
		КонецЦикла;	
		Возврат ЗначениеВнутр;
	ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) ИЛИ Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) Тогда
		Если Значение.Пустая() Тогда
			Возврат Неопределено;
		КонецЕсли;	
		Возврат Строка(Значение.УникальныйИдентификатор());
	Иначе
		Возврат Строка(Значение);
	КонецЕсли;	
КонецФункции


Функция GetPData(RNK_Number, RNK_Date)
	ДатаПериодаРНК = Дата(RNK_Date);
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ДокПаллета_ЛистыНабора.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ Вт_Паллеты
	                      |ИЗ
	                      |	Документ.Паллета.ЛистыНабора КАК ДокПаллета_ЛистыНабора
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Паллета КАК ДокПаллета
	                      |		ПО (ДокПаллета.Ссылка = ДокПаллета_ЛистыНабора.Ссылка)
	                      |			И (ДокПаллета.Проведен)
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК ДокРНК
	                      |		ПО (ДокРНК.Ссылка = ДокПаллета_ЛистыНабора.Документ)
	                      |ГДЕ
	                      |	ДокРНК.Номер = &НомерРНК
	                      |	И ДокРНК.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаРНК, ГОД) И КОНЕЦПЕРИОДА(&ДатаРНК, ГОД)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ДокПаллета.Ссылка КАК ПаллетаСсылка,
	                      |	ДокПаллета_Товары.SSCCКод КАК SSCCКод,
	                      |	ДокПаллета_Товары.Номенклатура КАК Номенклатура,
	                      |	ДокПаллета_Товары.Количество КАК Количество
	                      |ИЗ
	                      |	Документ.Паллета КАК ДокПаллета
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Паллета.Товары КАК ДокПаллета_Товары
	                      |		ПО (ДокПаллета_Товары.Ссылка = ДокПаллета.Ссылка)
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Вт_Паллеты КАК Вт_Паллеты
	                      |		ПО ДокПаллета.Ссылка = Вт_Паллеты.Ссылка
	                      |ГДЕ
	                      |	ДокПаллета.Проведен
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПаллетаСсылка,
	                      |	Номенклатура,
	                      |	SSCCКод");
	Запрос.УстановитьПараметр("НомерРНК",RNK_Number);
	Запрос.УстановитьПараметр("ДатаРНК",ДатаПериодаРНК);
	Таб = Запрос.Выполнить().Выгрузить();
	Возврат В_JSON(Таб);
КонецФункции

//Нечаева 03,02,26  +++ SNL-118
Функция GetPDataOb(RNK_Number, RNK_Date)
	
	ДатаПериодаРНК = Дата(RNK_Date);

	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ПаллетаЛистыНабора.Ссылка КАК Паллета,
	|	ПаллетаЛистыНабора.Описание КАК НомерКоробки,
	|	ПаллетаЛистыНабора.Ссылка.ОкончаниеПаллетирования КАК ОкончаниеПаллетирования,
	|	ПаллетаЛистыНабора.ШКЛистаНабора,
	|	ПаллетаЛистыНабора.ЛистНабора,
	|	ПаллетаЛистыНабора.Ссылка.SSCCКод
	|ИЗ
	|	Документ.Паллета.ЛистыНабора КАК ПаллетаЛистыНабора
	|ГДЕ
	|	ПаллетаЛистыНабора.Ссылка.Проведен
	|	И ПаллетаЛистыНабора.Документ.Номер = &НомерРНК
 	|	И ПаллетаЛистыНабора.Документ.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаРНК, ГОД) И КОНЕЦПЕРИОДА(&ДатаРНК, ГОД)
    |	И ПаллетаЛистыНабора.ЛистНабора.ТипШК = &Коробка";
	
    Запрос.УстановитьПараметр("НомерРНК",RNK_Number);
	Запрос.УстановитьПараметр("ДатаРНК",ДатаПериодаРНК); 
	запрос.УстановитьПараметр("Коробка", перечисления.ТипыШтрихКодов.Коробка);
	
	СписокСтрокизПаллет=запрос.Выполнить().Выгрузить();
	СписокСтрокизПаллет.Колонки.Добавить("Количество");
	СписокСтрокизПаллет.Колонки.Добавить("Номенклатура");
	
	
	Для Каждого Строка из СписокСтрокизПаллет Цикл
		
		ШККоробок = Новый ТаблицаЗначений; 
		//++Данилова Е.В. 25.05.2026  HELP-9853
		//ШККоробок =  ПолучитьСписокШКкоробокЛистаНабора(Строка.ЛистНабора);
		ШККоробок =  ПолучитьСписокШКкоробокЛистаНабора(Строка.ЛистНабора,,,ложь);
		//--Данилова Е.В. 25.05.2026 
		// ищем По ШК и прописываем количество.
		ТекНомер = Строка.НомерКоробки;
		НайденнаяСтрока = ШККоробок.Найти(Число(ТекНомер), "НомерКоробки");
		Если НайденнаяСтрока = Неопределено Тогда
			//Предупреждение("Товар не найден!");
		Иначе
			Строка.Номенклатура = НайденнаяСтрока.Номенклатура;
			Строка.Количество = НайденнаяСтрока.Номенклатура.Родитель.ШтукВКоробке;
		КонецЕсли;
		
	КонецЦикла;
	
	// вторая часть по блочкам и штукам
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ПаллетаЛистыНабора.Ссылка КАК Паллета,
	             |	ПаллетаЛистыНабора.ЛистНабора КАК ЛистНабора,
	             |	ВЫРАЗИТЬ(ПаллетаЛистыНабора.Ссылка.SSCCКод КАК СТРОКА(50)) КАК SSCCКод
	             |ИЗ
	             |	Документ.Паллета.ЛистыНабора КАК ПаллетаЛистыНабора
	             |ГДЕ
	             |	ПаллетаЛистыНабора.Ссылка.Проведен
	             |	И ПаллетаЛистыНабора.Документ.Номер = &НомерРНК
	             |	И ПаллетаЛистыНабора.Документ.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаРНК, ГОД) И КОНЕЦПЕРИОДА(&ДатаРНК, ГОД)
	             |	И ПаллетаЛистыНабора.ЛистНабора.ТипШК <> &Коробка";
	
    Запрос.УстановитьПараметр("НомерРНК",RNK_Number);
	Запрос.УстановитьПараметр("ДатаРНК",ДатаПериодаРНК); 
	запрос.УстановитьПараметр("Коробка", перечисления.ТипыШтрихКодов.Коробка);

	СписокСтрокизПаллет2=запрос.Выполнить().Выгрузить();
	СписокСтрокизПаллет2.Колонки.Добавить("Количество");
	СписокСтрокизПаллет2.Колонки.Добавить("Номенклатура");
	
	Для Каждого Строка из СписокСтрокизПаллет2 Цикл
		
		// весь лист набора это 1 коробка, просто переносим данные из Листа набора целиком в таблицу по этой Паллете.
		ЛНТовары = Строка.ЛистНабора.Товары;
		Для каждого ТекСтрока Из ЛНТовары Цикл
			
			НовСтр = СписокСтрокизПаллет.Добавить();
			НовСтр.Номенклатура = ТекСтрока.Номенклатура;
			НовСтр.SSCCКод = СокрЛП(Строка.SSCCКод)     ;
			НовСтр.ЛистНабора = Строка.ЛистНабора;
			НовСтр.Паллета = Строка.Паллета;
			НовСтр.количество = ТекСТрока.Количество; // тут всегда кол-во штук.
			
		КонецЦикла;
		
	КонецЦикла;
	
	СписокСтрокИзПаллет.Свернуть("Номенклатура, SSCCКод","Количество");
	СписокСтрокИзПаллет.Сортировать("Номенклатура");
	// если есть внутренняя комплектация, то поменяем комплектующие в листах набора на товар.
	ТЗКомпл= новый таблицазначений;
 	тзкомпл.колонки.Добавить("компл");
	тзкомпл.колонки.Добавить("номенк");
	
	// третья часть - комплектующие
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасходнаяНакладнаяКомплектующие.Номенклатура КАК Номенклатура,
	|	РасходнаяНакладнаяКомплектующие.Продукция КАК Продукция
	|ИЗ
	|	Документ.РасходнаяНакладная.Комплектующие КАК РасходнаяНакладнаяКомплектующие
	|ГДЕ
	|	РасходнаяНакладнаяКомплектующие.Ссылка.Номер = &НомерРНК
	|	И РасходнаяНакладнаяКомплектующие.Ссылка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаРНК, ГОД) И КОНЕЦПЕРИОДА(&ДатаРНК, ГОД)";
	
	
	Запрос.УстановитьПараметр("НомерРНК",RNK_Number);
	Запрос.УстановитьПараметр("ДатаРНК",ДатаПериодаРНК); 
	СписокКомплект=запрос.Выполнить().Выгрузить();

	Для каждого текстрока из СписокКомплект цикл
		
		Если Текстрока.номенклатура<> Текстрока.продукция ТОгда
			 Стр = тзкомпл.Добавить();
			 стр.номенк = Текстрока.продукция;
			 стр.компл = Текстрока.номенклатура;
		конецесли;	
 	конеццикла;
	
	Для каждого текстр из СписокСтрокИзПаллет цикл
	
		текном = текстр.номенклатура;
		для каждого текст2 из ТЗКомпл цикл
			 компл = текст2.компл;
			 Если Компл = текном тогда
				 текстр.номенклатура  = текст2.номенк;
			 конецесли;
		конеццикла;	
	конеццикла;
	СписокСтрокИзПаллет.Свернуть("Номенклатура, SSCCКод","Количество");
	СписокСтрокИзПаллет.Сортировать("Номенклатура");
  	
	// типизируем, чтобы можно было запросы по ней делать
	ТЗ2  = Новый ТаблицаЗначений;
	ТЗ2.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗ2.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число"));
	ТЗ2.Колонки.Добавить("SSCCКод",Новый ОписаниеТипов("строка"));
	ТЗ2.Колонки.Добавить("Ном2",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));;
	ТЗ2.Очистить();
	Для каждого Текстрока из СписокСтрокИзПаллет цикл
		Нстр = ТЗ2.Добавить();
		Нстр.Номенклатура = Текстрока.Номенклатура;
		Нстр.Количество = Текстрока.Количество;
		Нстр.SSCCКод = Текстрока.SSCCКод;
	КонецЦикла;
	
	//	возврат  тз2;
 //Таб = Запрос.Выполнить().Выгрузить();
 
	Возврат В_JSON(ТЗ2); 
	
КонецФункции

// Нечаева 03,02,26 --- SNL-118
